[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://svgshare.com/i/14jP.svg",
    "review": "A timeless classic that captures the essence of the Jazz Age. The story follows the mysterious Jay Gatsby, whose extravagant lifestyle masks a deeper longing. Through vivid prose, Fitzgerald paints a picture of love, ambition, and the disillusionment of the American Dream. The characters are richly drawn, each representing a facet of society in the Roaring Twenties. The Great Gatsby remains relevant today as a commentary on the pursuit of wealth and happiness.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Romance", "American Literature"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://svgshare.com/i/14iA.svg",
    "review": "An unforgettable story of racial injustice and moral growth. Set in the fictional town of Maycomb, Alabama, the novel explores themes of compassion, integrity, and prejudice. Through the eyes of young Scout Finch, readers witness the trial of Tom Robinson and the quiet heroism of her father, Atticus. Harper Lee's prose is both evocative and powerful, capturing the complexities of human nature. To Kill a Mockingbird continues to resonate, reminding us of the importance of empathy and standing up for what is right.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Classic", "Legal Drama", "Southern Gothic"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://svgshare.com/i/14js.svg",
    "review": "A chilling portrayal of a dystopian society controlled by surveillance and manipulation. Orwell's vision of a totalitarian regime is both prophetic and unsettling. The novel's protagonist, Winston Smith, rebels against the Party's oppressive rule, only to be ensnared in its web of deceit. Through Newspeak and doublethink, Orwell explores the power of language to shape reality. 1984 serves as a stark warning against the dangers of authoritarianism and the erosion of individual freedoms.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Dystopian", "Political Fiction", "Totalitarianism"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://svgshare.com/i/14jX.svg",
    "review": "A witty and charming novel exploring themes of love, class, and society. Jane Austen's masterpiece introduces readers to the spirited Elizabeth Bennet and the enigmatic Mr. Darcy. Through their tumultuous courtship, Austen deftly examines the intricacies of social hierarchy and the folly of snap judgments. With its sharp wit and timeless romance, Pride and Prejudice delights readers of all generations. Austen's keen observations on human nature ensure that this novel remains a beloved classic.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Classic", "Romance", "Regency Era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://svgshare.com/i/14ir.svg",
    "review": "A poignant story of teenage angst and alienation. J.D. Salinger's novel follows the rebellious Holden Caulfield as he navigates the complexities of adolescence. Through Holden's cynical yet vulnerable voice, Salinger captures the universal struggle for identity and belonging. The Catcher in the Rye is a timeless coming-of-age tale that continues to resonate with readers of all ages. Salinger's portrayal of youth and disillusionment remains as powerful today as it was upon its publication.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Coming-of-age", "American Literature", "Cultural Critique"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://svgshare.com/i/14iK.svg",
    "review": "An enchanting adventure filled with dwarves, elves, and a courageous hobbit. J.R.R. Tolkien's tale transports readers to the fantastical world of Middle-earth. Bilbo Baggins, an unlikely hero, embarks on a journey to reclaim treasure guarded by the fearsome dragon Smaug. Along the way, he encounters trolls, goblins, and other dangers. The Hobbit is a captivating epic that appeals to readers of all ages, with its themes of friendship, courage, and the triumph of good over evil.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Middle-earth", "Children's Literature"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  }
]
